
;פרוצדורה שמשנה למצב גרפי
proc GraphicMod
	push ax
	mov al, 13h
	mov ah, 0
	int 10h
	pop ax
	ret
endp GraphicMod



;=============================================================================================================================================================



;פרוצדורה שמשנה למצב טקסט
proc TextMod
	push ax
	mov al, 3h
	mov ah, 0
	int 10h
	pop ax
	ret
endp TextMod



;=============================================================================================================================================================



;הפעלת העכבר
proc activeMouse
	push ax
	mov ax, 1
	INT 33h
	pop ax
	ret
endp activeMouse



;=============================================================================================================================================================



;אתחול העכבר
proc mouse
	push ax
	mov ax, 0
	INT 33h
	pop ax
	ret
endp mouse



;=============================================================================================================================================================



;קבלת סטטוס העכבר
proc mouseStatus
	push ax
	mov ax, 3h
	INT 33h
	SHR cx, 1
	pop ax
	ret
endp mouseStatus 

; bx = מצב הלחיצה של כפתורי העכבר- כפתור שמאלי לחוץ הביט במקום ה0 שווה 1. כפתור ימני לחוץ הביט במקום ה1 שווה 1
; cx = מיקום אופקי של הנקודה החמה
; dx = מיקום אנכי של הנקודה החמה



;=============================================================================================================================================================
