
;קריאת השעה
proc readTime
	mov ah, 2ch
	int 21h
	ret
endp readTime ; ch = hours     cl = minutes     dh = seconds     dl = miliseconds 



;=============================================================================================================================================================



;מחכה שנייה
proc second
	push bp
	PushAll
	mov cx, 10
	mov dx, 0
	mov ah, 86h
	int 15h
	PopAll
	pop bp
	ret
endp second
	
	
	
;=============================================================================================================================================================
